In [1]:
import numpy as np
import pandas as pd

In [5]:
my_dictionary = {"Lewis":[40,30,np.nan],"Max":[20,np.nan,50],"Yusuf_Ali":[30,50,40]}

In [6]:
my_data_frame = pd.DataFrame(my_dictionary)

In [7]:
my_data_frame

   Lewis   Max  Yusuf_Ali
0   40.0  20.0         30
1   30.0   NaN         50
2    NaN  50.0         40

In [8]:
# dropna da ki na nin anlami " not avaliable "
my_data_frame.dropna()

   Lewis   Max  Yusuf_Ali
0   40.0  20.0         30

In [9]:
my_data_frame

   Lewis   Max  Yusuf_Ali
0   40.0  20.0         30
1   30.0   NaN         50
2    NaN  50.0         40

In [10]:
my_data_frame.dropna(axis = 1)

   Yusuf_Ali
0         30
1         50
2         40

In [11]:
my_new_dictionary = {"Lewis":[40,30,np.nan],"Max":[20,np.nan,50],"Yusuf_Ali":[30,50,40], "Rob":[45,np.nan,np.nan]}

In [12]:
my_new_data_frame = pd.DataFrame(my_new_dictionary)

In [13]:
my_new_data_frame

   Lewis   Max  Yusuf_Ali   Rob
0   40.0  20.0         30  45.0
1   30.0   NaN         50   NaN
2    NaN  50.0         40   NaN

In [16]:
#thresh ----> verdigin degerin altinda kalan birsey varsa siler
my_new_data_frame.dropna(axis=1, thresh = 2)

   Lewis   Max  Yusuf_Ali
0   40.0  20.0         30
1   30.0   NaN         50
2    NaN  50.0         40

In [17]:
my_new_data_frame

   Lewis   Max  Yusuf_Ali   Rob
0   40.0  20.0         30  45.0
1   30.0   NaN         50   NaN
2    NaN  50.0         40   NaN

In [19]:
# fillna ----> not avaliable olanlari doldur demek
my_new_data_frame.fillna(-1)

   Lewis   Max  Yusuf_Ali   Rob
0   40.0  20.0         30  45.0
1   30.0  -1.0         50  -1.0
2   -1.0  50.0         40  -1.0

#GRUPLANDIRMA

In [24]:
salary_dict = {"Programming Language":["Python","Python","Python","Java","Java","Swift"], "Names":["A","B","C","D","E","F"], "Salary":[100,90,80,70,60,50]}

In [25]:
salary_frame = pd.DataFrame(salary_dict)

In [26]:
salary_frame

  Programming Language Names  Salary
0               Python     A     100
1               Python     B      90
2               Python     C      80
3                 Java     D      70
4                 Java     E      60
5                Swift     F      50

In [33]:
group_obj = salary_frame.groupby("Programming Language")

In [34]:
group_obj.count()

                      Names  Salary
Programming Language
Java                      2       2
Python                    3       3
Swift                     1       1

In [37]:
group_obj

In [40]:
# error veriyor egerki numeric_only=True yazmazsak
group_obj.mean(numeric_only=True)

                      Salary
Programming Language
Java                    65.0
Python                  90.0
Swift                   50.0

In [41]:
group_obj.min()

                     Names  Salary
Programming Language
Java                     D      60
Python                   A      80
Swift                    F      50

In [42]:
group_obj.max()

                     Names  Salary
Programming Language
Java                     E      70
Python                   C     100
Swift                    F      50

In [43]:
group_obj.min("Salary")

                      Salary
Programming Language
Java                      60
Python                    80
Swift                     50

In [44]:
group_obj.max("Salary")

                      Salary
Programming Language
Java                      70
Python                   100
Swift                     50

In [46]:
help(group_obj.min)

Help on method min in module pandas.core.groupby.groupby:

min(
    numeric_only: 'bool' = False,
    min_count: 'int' = -1,
    engine: "Literal['cython', 'numba'] | None" = None,
    engine_kwargs: 'dict[str, bool] | None' = None
) method of pandas.core.groupby.generic.DataFrameGroupBy instance
    Compute min of group values.

    Parameters
    ----------
    numeric_only : bool, default False
        Include only float, int, boolean columns.

        .. versionchanged:: 2.0.0

            numeric_only no longer accepts ``None``.

    min_count : int, default -1
        The required number of valid values to perform the operation. If fewer
        than ``min_count`` non-NA values are present the result will be NA.

    engine : str, default None None
        * ``'cython'`` : Runs rolling apply through C-extensions from cython.
        * ``'numba'`` : Runs rolling apply through JIT compiled code from numba.
            Only available when ``raw`` is set to ``True``.
        * ``None`` : Defaults to ``'cython'`` or globally setting ``compute.use_numba``

    engine_kwargs : dict, default None None
        * For ``'cython'`` engine, there are no accepted ``engine_kwargs``
        * For ``'numba'`` engine, the engine can accept ``nopython``, ``nogil``
            and ``parallel`` dictionary keys. The values must either be ``True`` or
            ``False``. The default ``engine_kwargs`` for the ``'numba'`` engine is
            ``{'nopython': True, 'nogil': False, 'parallel': False}`` and will be
            applied to both the ``func`` and the ``apply`` groupby aggregation.

    Returns
    -------
    Series or DataFrame
        Computed min of values within each group.

    Examples
    --------
    For SeriesGroupBy:

    >>> lst = ['a', 'a', 'b', 'b']
    >>> ser = pd.Series([1, 2, 3, 4], index=lst)
    >>> ser
    a    1
    a    2
    b    3
    b    4
    dtype: int64
    >>> ser.groupby(level=0).min()
    a    1
    b    3
    dtype: int64

    For DataFrameGroupBy:

    >>> data = [[1, 8, 2], [1, 2, 5], [2, 5, 8], [2, 6, 9]]
    >>> df = pd.DataFrame(data, columns=["a", "b", "c"],
    ...                   index=["tiger", "leopard", "cheetah", "lion"])
    >>> df
              a  b  c
      tiger   1  8  2
    leopard   1  2  5
    cheetah   2  5  8
       lion   2  6  9
    >>> df.groupby("a").min()
        b  c
    a
    1   2  2
    2   5  8

In [47]:
group_obj.min(numeric_only=True)

                      Salary
Programming Language
Java                      60
Python                    80
Swift                     50

In [49]:
# std ---> standart sapma
# decribe bizim icin ozet cikarir
group_obj.describe()

                     Salary
                      count  mean        std   min   25%   50%   75%    max
Programming Language
Java                    2.0  65.0   7.071068  60.0  62.5  65.0  67.5   70.0
Python                  3.0  90.0  10.000000  80.0  85.0  90.0  95.0  100.0
Swift                   1.0  50.0        NaN  50.0  50.0  50.0  50.0   50.0

In [56]:
my_dict1 = {"Name":["A","B","C","D"],
            "Sports":["Basketball","Football","Tennis","Running"],
            "Calories":[100,200,300,400]}

In [70]:
my_frame1 = pd.DataFrame(my_dict1, index=[0,1,2,3])

In [71]:
my_frame1

  Name      Sports  Calories
0    A  Basketball       100
1    B    Football       200
2    C      Tennis       300
3    D     Running       400

In [72]:
my_dict2 = {"Name":["E","F","G","H"],
            "Sports":["Basketball","Football","Tennis","Running"],
            "Calories":[200,50,330,440]}

In [73]:
my_frame2 = pd.DataFrame(my_dict2, index=[4,5,6,7])

In [74]:
my_frame2

  Name      Sports  Calories
4    E  Basketball       200
5    F    Football        50
6    G      Tennis       330
7    H     Running       440

In [75]:
my_dict3 = {"Name":["I","J","K","L"],
            "Sports":["Basketball","Football","Tennis","Running"],
            "Calories":[300,150,320,410]}

In [76]:
my_frame3 = pd.DataFrame(my_dict3, index= [8,9,10,11])

In [77]:
my_frame3

   Name      Sports  Calories
8     I  Basketball       300
9     J    Football       150
10    K      Tennis       320
11    L     Running       410

In [78]:
# concat --> concatenation
# listeleri birlestirir

In [79]:
pd.concat([my_frame1,my_frame2,my_frame3])

   Name      Sports  Calories
0     A  Basketball       100
1     B    Football       200
2     C      Tennis       300
3     D     Running       400
4     E  Basketball       200
5     F    Football        50
6     G      Tennis       330
7     H     Running       440
8     I  Basketball       300
9     J    Football       150
10    K      Tennis       320
11    L     Running       410

In [81]:
# merge
# birlestirme, ic ice gecirerek

In [82]:
my_frame1

  Name      Sports  Calories
0    A  Basketball       100
1    B    Football       200
2    C      Tennis       300
3    D     Running       400

In [83]:
my_frame2

  Name      Sports  Calories
4    E  Basketball       200
5    F    Football        50
6    G      Tennis       330
7    H     Running       440

In [84]:
pd.merge(my_frame1,my_frame2, on="Sports")

  Name_x      Sports  Calories_x Name_y  Calories_y
0      A  Basketball         100      E         200
1      B    Football         200      F          50
2      C      Tennis         300      G         330
3      D     Running         400      H         440

In [85]:
new_salary_frame = pd.DataFrame({"Name":["Max","Alonso","Ali"], "Salary":[10,20,30], "Age":[60,65,70]})

In [86]:
new_salary_frame

     Name  Salary  Age
0     Max      10   60
1  Alonso      20   65
2     Ali      30   70

In [88]:
# unique ---> benzersiz
new_salary_frame["Name"].unique()

array(['Max', 'Alonso', 'Ali'], dtype=object)

In [90]:
# nuniqe ---> number of unique
new_salary_frame["Name"].nunique()

3

In [91]:
def grossToNet(salary):
    return salary * 0.65

In [93]:
# apply ----> uygula
# net maasi bulmak icin ornek
new_salary_frame["Salary"].apply(grossToNet)

0     6.5
1    13.0
2    19.5
Name: Salary, dtype: float64